___

<p style="text-align: center;"><img src="https://docs.google.com/uc?id=1lY0Uj5R04yMY3-ZppPWxqCr5pvBLYPnV" class="img-fluid" alt="Rossum"></p>


____

In [1]:
import pandas as pd

In [2]:
ecom = pd.read_csv('data.csv',encoding= 'unicode_escape')

**Check the head of the DataFrame.**

In [3]:
ecom.head()

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country
0,536365,85123A,WHITE HANGING HEART T-LIGHT HOLDER,6,12/1/2010 8:26,2.55,17850.0,United Kingdom
1,536365,71053,WHITE METAL LANTERN,6,12/1/2010 8:26,3.39,17850.0,United Kingdom
2,536365,84406B,CREAM CUPID HEARTS COAT HANGER,8,12/1/2010 8:26,2.75,17850.0,United Kingdom
3,536365,84029G,KNITTED UNION FLAG HOT WATER BOTTLE,6,12/1/2010 8:26,3.39,17850.0,United Kingdom
4,536365,84029E,RED WOOLLY HOTTIE WHITE HEART.,6,12/1/2010 8:26,3.39,17850.0,United Kingdom

** How many rows and columns are there? **

In [11]:
ecom.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 541909 entries, 0 to 541908
Data columns (total 8 columns):
 #   Column       Non-Null Count   Dtype
---  ------       --------------   -----
 0   InvoiceNo    541909 non-null  object
 1   StockCode    541909 non-null  object
 2   Description  540455 non-null  object
 3   Quantity     541909 non-null  int64
 4   InvoiceDate  541909 non-null  object
 5   UnitPrice    541909 non-null  float64
 6   CustomerID   406829 non-null  float64
 7   Country      541909 non-null  object
dtypes: float64(2), int64(1), object(5)
memory usage: 33.1+ MB

** Show the statistical measurements of ecom dataset **

In [12]:
ecom.describe()

            Quantity      UnitPrice     CustomerID
count  541909.000000  541909.000000  406829.000000
mean        9.552250       4.611114   15287.690570
std       218.081158      96.759853    1713.600303
min    -80995.000000  -11062.060000   12346.000000
25%         1.000000       1.250000   13953.000000
50%         3.000000       2.080000   15152.000000
75%        10.000000       4.130000   16791.000000
max     80995.000000   38970.000000   18287.000000

** What is the average Purchase Price? **

In [8]:
ecom.head(3)

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country
0,536365,85123A,WHITE HANGING HEART T-LIGHT HOLDER,6,12/1/2010 8:26,2.55,17850.0,United Kingdom
1,536365,71053,WHITE METAL LANTERN,6,12/1/2010 8:26,3.39,17850.0,United Kingdom
2,536365,84406B,CREAM CUPID HEARTS COAT HANGER,8,12/1/2010 8:26,2.75,17850.0,United Kingdom

In [4]:
ecom["purchase_p"] = ecom["Quantity"]*ecom["UnitPrice"]

In [5]:
ecom.head(3)

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country,purchase_p
0,536365,85123A,WHITE HANGING HEART T-LIGHT HOLDER,6,12/1/2010 8:26,2.55,17850.0,United Kingdom,15.30
1,536365,71053,WHITE METAL LANTERN,6,12/1/2010 8:26,3.39,17850.0,United Kingdom,20.34
2,536365,84406B,CREAM CUPID HEARTS COAT HANGER,8,12/1/2010 8:26,2.75,17850.0,United Kingdom,22.00

In [17]:
ecom.UnitPrice.mean()

4.611113626083471

** What were the highest and lowest purchase prices? **

In [10]:
ecom.UnitPrice.max()

38970.0

In [9]:
ecom.UnitPrice.min()

-11062.06

** List the country names and number of records belongs to each country **

In [ ]:
ecom['Country'].value_counts()

United Kingdom          495478
Germany                   9495
France                    8557
EIRE                      8196
Spain                     2533
Netherlands               2371
Belgium                   2069
Switzerland               2002
Portugal                  1519
Australia                 1259
Norway                    1086
Italy                      803
Channel Islands            758
Finland                    695
Cyprus                     622
Sweden                     462
Unspecified                446
Austria                    401
Denmark                    389
Japan                      358
Poland                     341
Israel                     297
USA                        291
Hong Kong                  288
Singapore                  229
Iceland                    182
Canada                     151
Greece                     146
Malta                      127
United Arab Emirates        68
European Community          61
RSA                         58
Lebanon                     45
Lithuania                   35
Brazil                      32
Czech Republic              30
Bahrain                     19
Saudi Arabia                10
Name: Country, dtype: int64

** How many records are as Country United Kingdom? **

In [18]:
ecom.head(3)

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country,purchase_p
0,536365,85123A,WHITE HANGING HEART T-LIGHT HOLDER,6,12/1/2010 8:26,2.55,17850.0,United Kingdom,15.30
1,536365,71053,WHITE METAL LANTERN,6,12/1/2010 8:26,3.39,17850.0,United Kingdom,20.34
2,536365,84406B,CREAM CUPID HEARTS COAT HANGER,8,12/1/2010 8:26,2.75,17850.0,United Kingdom,22.00

In [26]:
ecom[ecom["Country"]=="United Kingdom"].count()

InvoiceNo      495478
StockCode      495478
Description    494024
Quantity       495478
InvoiceDate    495478
UnitPrice      495478
CustomerID     361878
Country        495478
purchase_p     495478
dtype: int64

** Create a column named Total which shows the total amount of spend using UnitPrice and Quantity ? **

In [27]:
ecom.head()

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country,purchase_p
0,536365,85123A,WHITE HANGING HEART T-LIGHT HOLDER,6,12/1/2010 8:26,2.55,17850.0,United Kingdom,15.30
1,536365,71053,WHITE METAL LANTERN,6,12/1/2010 8:26,3.39,17850.0,United Kingdom,20.34
2,536365,84406B,CREAM CUPID HEARTS COAT HANGER,8,12/1/2010 8:26,2.75,17850.0,United Kingdom,22.00
3,536365,84029G,KNITTED UNION FLAG HOT WATER BOTTLE,6,12/1/2010 8:26,3.39,17850.0,United Kingdom,20.34
4,536365,84029E,RED WOOLLY HOTTIE WHITE HEART.,6,12/1/2010 8:26,3.39,17850.0,United Kingdom,20.34

In [32]:
ecom.loc[:,"purchase_p"]

0         15.30
1         20.34
2         22.00
3         20.34
4         20.34
          ...
541904    10.20
541905    12.60
541906    16.60
541907    16.60
541908    14.85
Name: purchase_p, Length: 541909, dtype: float64

** Show total pending amount according to the Countries **

In [60]:
ecom.groupby("Country")["purchase_p"].sum()

Country
Australia                137077.270
Austria                   10154.320
Bahrain                     548.400
Belgium                   40910.960
Brazil                     1143.600
Canada                     3666.380
Channel Islands           20086.290
Cyprus                    12946.290
Czech Republic              707.720
Denmark                   18768.140
EIRE                     263276.820
European Community         1291.750
Finland                   22326.740
France                   197403.900
Germany                  221698.210
Greece                     4710.520
Hong Kong                 10117.040
Iceland                    4310.000
Israel                     7907.820
Italy                     16890.510
Japan                     35340.620
Lebanon                    1693.880
Lithuania                  1661.060
Malta                      2505.470
Netherlands              284661.540
Norway                    35163.460
Poland                     7213.140
Portugal                  29367.020
RSA                        1002.310
Saudi Arabia                131.170
Singapore                  9120.390
Spain                     54774.580
Sweden                    36595.910
Switzerland               56385.350
USA                        1730.920
United Arab Emirates       1902.280
United Kingdom          8187806.364
Unspecified                4749.790
Name: purchase_p, dtype: float64

** Which Country spend least? **

In [64]:
df1 = ecom.groupby("Country").sum()["purchase_p"].sort_values(ascending = False).tail(1)
df1

Country
Saudi Arabia    131.17
Name: purchase_p, dtype: float64

In [63]:
#df1.index[-1]

'Saudi Arabia'

** Calculate average of spending according to country with apply function? **

In [8]:
import numpy as np

In [10]:
df3= ecom.groupby("Country")["purchase_p"].apply(np.mean)
df3

Country
Australia               108.877895
Austria                  25.322494
Bahrain                  28.863158
Belgium                  19.773301
Brazil                   35.737500
Canada                   24.280662
Channel Islands          26.499063
Cyprus                   20.813971
Czech Republic           23.590667
Denmark                  48.247147
EIRE                     32.122599
European Community       21.176230
Finland                  32.124806
France                   23.069288
Germany                  23.348943
Greece                   32.263836
Hong Kong                35.128611
Iceland                  23.681319
Israel                   26.625657
Italy                    21.034259
Japan                    98.716816
Lebanon                  37.641778
Lithuania                47.458857
Malta                    19.728110
Netherlands             120.059696
Norway                   32.378877
Poland                   21.152903
Portugal                 19.333127
RSA                      17.281207
Saudi Arabia             13.117000
Singapore                39.827031
Spain                    21.624390
Sweden                   79.211926
Switzerland              28.164510
USA                       5.948179
United Arab Emirates     27.974706
United Kingdom           16.525065
Unspecified              10.649753
Name: purchase_p, dtype: float64

** Calculate average,mean,max of spending according to country with agg function? **

In [6]:
ecom.head(3)

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country,purchase_p
0,536365,85123A,WHITE HANGING HEART T-LIGHT HOLDER,6,12/1/2010 8:26,2.55,17850.0,United Kingdom,15.30
1,536365,71053,WHITE METAL LANTERN,6,12/1/2010 8:26,3.39,17850.0,United Kingdom,20.34
2,536365,84406B,CREAM CUPID HEARTS COAT HANGER,8,12/1/2010 8:26,2.75,17850.0,United Kingdom,22.00

In [12]:
#cevapta min max mean gzkyor soruda mean, median max var
ecom.groupby("Country")["purchase_p"].agg([np.mean, np.median, np.max])

                            mean  median       amax
Country
Australia             108.877895   51.84    1718.40
Austria                25.322494   17.00     360.00
Bahrain                28.863158   25.50     205.74
Belgium                19.773301   16.60     165.00
Brazil                 35.737500   19.65     175.20
Canada                 24.280662   16.50     550.94
Channel Islands        26.499063   17.70     408.00
Cyprus                 20.813971   16.20     320.69
Czech Republic         23.590667   25.30      70.80
Denmark                48.247147   23.40     428.40
EIRE                   32.122599   17.34    2365.20
European Community     21.176230   17.70      60.00
Finland                32.124806   17.85     551.20
France                 23.069288   16.50    4161.06
Germany                23.348943   16.60     876.00
Greece                 32.263836   16.60     175.20
Hong Kong              35.128611   23.40    2653.95
Iceland                23.681319   17.00     249.60
Israel                 26.625657   17.85     350.40
Italy                  21.034259   17.40     300.00
Japan                  98.716816   61.20    3794.40
Lebanon                37.641778   31.60     153.00
Lithuania              47.458857   45.00     122.40
Malta                  19.728110   17.00     455.00
Netherlands           120.059696   91.80    4992.00
Norway                 32.378877   19.80     700.00
Poland                 21.152903   17.40     120.00
Portugal               19.333127   15.80    1241.98
RSA                    17.281207   16.50      38.25
Saudi Arabia           13.117000   17.70      19.80
Singapore              39.827031   34.80    3949.32
Spain                  21.624390   15.00    1350.00
Sweden                 79.211926   30.00    1188.00
Switzerland            28.164510   17.40     360.00
USA                     5.948179   10.50      81.36
United Arab Emirates   27.974706   20.40     153.00
United Kingdom         16.525065    8.29  168469.60
Unspecified            10.649753    8.80      69.36

** What is the max Total spending in whole dataset and show the records of that spending ?**

In [42]:
ecom.sort_values(by="purchase_p", ascending=True).tail(1)

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country,purchase_p
540421,581483,23843,"PAPER CRAFT , LITTLE BIRDIE",80995,12/9/2011 9:15,2.08,16446.0,United Kingdom,168469.6

** How many people who live in Spain spend more than average Total ?**

In [45]:
ecom.head(5)

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country,purchase_p
0,536365,85123A,WHITE HANGING HEART T-LIGHT HOLDER,6,12/1/2010 8:26,2.55,17850.0,United Kingdom,15.30
1,536365,71053,WHITE METAL LANTERN,6,12/1/2010 8:26,3.39,17850.0,United Kingdom,20.34
2,536365,84406B,CREAM CUPID HEARTS COAT HANGER,8,12/1/2010 8:26,2.75,17850.0,United Kingdom,22.00
3,536365,84029G,KNITTED UNION FLAG HOT WATER BOTTLE,6,12/1/2010 8:26,3.39,17850.0,United Kingdom,20.34
4,536365,84029E,RED WOOLLY HOTTIE WHITE HEART.,6,12/1/2010 8:26,3.39,17850.0,United Kingdom,20.34

In [ ]:
ecom.groupby("Country",)

In [48]:
ecom[(ecom["Country"]=="Spain") & (ecom["purchase_p"] > ecom["purchase_p"].mean())]["CustomerID"].count()

728

** Convert datatype of InvoiceDate to datetime and assign it to new column name InvoiceDate2**

In [58]:
ecom['InvoiceDate'] =  pd.to_datetime(ecom['InvoiceDate'], infer_datetime_format=True)
ecom.InvoiceDate

0        2010-12-01 08:26:00
1        2010-12-01 08:26:00
2        2010-12-01 08:26:00
3        2010-12-01 08:26:00
4        2010-12-01 08:26:00
                 ...
541904   2011-12-09 12:50:00
541905   2011-12-09 12:50:00
541906   2011-12-09 12:50:00
541907   2011-12-09 12:50:00
541908   2011-12-09 12:50:00
Name: InvoiceDate, Length: 541909, dtype: datetime64[ns]

In [65]:
ecom.head(2)

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country,purchase_p,InvoiceDate2
0,536365,85123A,WHITE HANGING HEART T-LIGHT HOLDER,6,2010-12-01 08:26:00,2.55,17850.0,United Kingdom,15.30,2010-12-01 08:26:00
1,536365,71053,WHITE METAL LANTERN,6,2010-12-01 08:26:00,3.39,17850.0,United Kingdom,20.34,2010-12-01 08:26:00

** Take only date values (year-month-day) from InvoiceDate2 and assign it to a new column named date **

In [66]:
pd.to_datetime(ecom.InvoiceDate2,)

0        2010-12-01 08:26:00
1        2010-12-01 08:26:00
2        2010-12-01 08:26:00
3        2010-12-01 08:26:00
4        2010-12-01 08:26:00
                 ...
541904   2011-12-09 12:50:00
541905   2011-12-09 12:50:00
541906   2011-12-09 12:50:00
541907   2011-12-09 12:50:00
541908   2011-12-09 12:50:00
Name: InvoiceDate2, Length: 541909, dtype: datetime64[ns]

In [83]:
import datetime as dt

In [94]:
ecom['Date']=pd.to_datetime(ecom['InvoiceDate2'], format='%Y-%m-%d')
ecom["Date"].dt.to_period("d")

0         2010-12-01
1         2010-12-01
2         2010-12-01
3         2010-12-01
4         2010-12-01
             ...
541904    2011-12-09
541905    2011-12-09
541906    2011-12-09
541907    2011-12-09
541908    2011-12-09
Name: Date, Length: 541909, dtype: period[D]

In [95]:
ecom['Date'] = ecom["Date"].dt.to_period("d")
ecom.head()

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country,purchase_p,InvoiceDate2,Date
0,536365,85123A,WHITE HANGING HEART T-LIGHT HOLDER,6,2010-12-01 08:26:00,2.55,17850.0,United Kingdom,15.30,2010-12-01 08:26:00,2010-12-01
1,536365,71053,WHITE METAL LANTERN,6,2010-12-01 08:26:00,3.39,17850.0,United Kingdom,20.34,2010-12-01 08:26:00,2010-12-01
2,536365,84406B,CREAM CUPID HEARTS COAT HANGER,8,2010-12-01 08:26:00,2.75,17850.0,United Kingdom,22.00,2010-12-01 08:26:00,2010-12-01
3,536365,84029G,KNITTED UNION FLAG HOT WATER BOTTLE,6,2010-12-01 08:26:00,3.39,17850.0,United Kingdom,20.34,2010-12-01 08:26:00,2010-12-01
4,536365,84029E,RED WOOLLY HOTTIE WHITE HEART.,6,2010-12-01 08:26:00,3.39,17850.0,United Kingdom,20.34,2010-12-01 08:26:00,2010-12-01

** drop InvoiceDate2 and InvoiceDate columns permanently **

In [ ]:
ecom.drop(columns=["InvoiceDate", "InvoiceDate2"], axis=1, inplace=True)

In [103]:
ecom.head()

,InvoiceNo,StockCode,Description,Quantity,UnitPrice,CustomerID,Country,purchase_p,Date
0,536365,85123A,WHITE HANGING HEART T-LIGHT HOLDER,6,2.55,17850.0,United Kingdom,15.30,2010-12-01
1,536365,71053,WHITE METAL LANTERN,6,3.39,17850.0,United Kingdom,20.34,2010-12-01
2,536365,84406B,CREAM CUPID HEARTS COAT HANGER,8,2.75,17850.0,United Kingdom,22.00,2010-12-01
3,536365,84029G,KNITTED UNION FLAG HOT WATER BOTTLE,6,3.39,17850.0,United Kingdom,20.34,2010-12-01
4,536365,84029E,RED WOOLLY HOTTIE WHITE HEART.,6,3.39,17850.0,United Kingdom,20.34,2010-12-01

** Remove A, B, G and E from first 5 rows of ecom dataframe with a string method **

0    85123
1    71053
2    84406
3    84029
4    84029
Name: StockCode, dtype: object

** take only Total and date columns with loc and craete a new df named ecom2 **

In [137]:
ecom2 = ecom.loc[:, ["purchase_p","Date"]]
ecom2

        purchase_p        Date
0            15.30  2010-12-01
1            20.34  2010-12-01
2            22.00  2010-12-01
3            20.34  2010-12-01
4            20.34  2010-12-01
...            ...         ...
541904       10.20  2011-12-09
541905       12.60  2011-12-09
541906       16.60  2011-12-09
541907       16.60  2011-12-09
541908       14.85  2011-12-09

[541909 rows x 2 columns]

** take only InvoiceNo and CustomerID columns with iloc and craete a new df named ecom3 **

In [136]:
ecom3 = ecom.loc[:,["InvoiceNo", "CustomerID","purchase_p"]]
ecom3

       InvoiceNo  CustomerID  purchase_p
0         536365     17850.0       15.30
1         536365     17850.0       20.34
2         536365     17850.0       22.00
3         536365     17850.0       20.34
4         536365     17850.0       20.34
...          ...         ...         ...
541904    581587     12680.0       10.20
541905    581587     12680.0       12.60
541906    581587     12680.0       16.60
541907    581587     12680.0       16.60
541908    581587     12680.0       14.85

[541909 rows x 3 columns]

** Combine ecom2 and ecom3 with concat **

In [118]:
pd.concat([ecom2, ecom3], axis=1)

        purchase_p        Date InvoiceNo  CustomerID  purchase_p
0            15.30  2010-12-01    536365     17850.0       15.30
1            20.34  2010-12-01    536365     17850.0       20.34
2            22.00  2010-12-01    536365     17850.0       22.00
3            20.34  2010-12-01    536365     17850.0       20.34
4            20.34  2010-12-01    536365     17850.0       20.34
...            ...         ...       ...         ...         ...
541904       10.20  2011-12-09    581587     12680.0       10.20
541905       12.60  2011-12-09    581587     12680.0       12.60
541906       16.60  2011-12-09    581587     12680.0       16.60
541907       16.60  2011-12-09    581587     12680.0       16.60
541908       14.85  2011-12-09    581587     12680.0       14.85

[541909 rows x 5 columns]

** Combine ecom2 and ecom3 with merge **

In [142]:
pd.merge(ecom2,ecom3,on=["purchase_p"],how="inner")

MemoryError: Unable to allocate 15.3 GiB for an array with shape (2055493085,) and data type int64

** Combine ecom2 and ecom3 with join **

In [129]:
ecom2.join(ecom3, lsuffix="_left", rsuffix="_right")

        purchase_p_left        Date InvoiceNo  CustomerID  purchase_p_right
0                 15.30  2010-12-01    536365     17850.0             15.30
1                 20.34  2010-12-01    536365     17850.0             20.34
2                 22.00  2010-12-01    536365     17850.0             22.00
3                 20.34  2010-12-01    536365     17850.0             20.34
4                 20.34  2010-12-01    536365     17850.0             20.34
...                 ...         ...       ...         ...               ...
541904            10.20  2011-12-09    581587     12680.0             10.20
541905            12.60  2011-12-09    581587     12680.0             12.60
541906            16.60  2011-12-09    581587     12680.0             16.60
541907            16.60  2011-12-09    581587     12680.0             16.60
541908            14.85  2011-12-09    581587     12680.0             14.85

[541909 rows x 5 columns]

# Congrats!